{"date": "2013-08-25", "source": "ace26d6a-1d29-4ff2-ab8d-47c2635a08d0.html", "notes": [{"content": "Hobbits are an unobtrusive but very ancient people, more numerous formerly than they are today; for they love peace and quiet and good tilled earth: a well-ordered and well-farmed countryside was their favourite haunt.", "time": "2013-08-25 17:37:38"}, {"content": "Thus, the only craft little practised among them was shoe-making; but they had long and skilful fingers and could make many other useful and comely things.", "time": "2013-08-25 17:44:20"}, {"content": "Only the Elves still preserve any records of that vanished time, and their traditions are concerned almost entirely with their own history, in which Men appear seldom and Hobbits are not mentioned at all.", "time": "2013-08-25 17:47:24"}, {"content": "the regions in which Hobbits then lived were doubtless the same as those in which they still linger: the North-West of the Old World, east of the Sea.", "time": "2013-08-25 17:51:20"}, {"content": "Before the crossing of the mountains the Hobbits had already become divided into three somewhat different breeds: Harfoots, Stoors, and Fallohides.", "time": "2013-08-25 18:30:41"}, {"content": "Thus began the Shire-reckoning, for the year of the crossing of the Brandywine (as the Hobbits turned the name) became Year One of the Shire, and all later dates were reckoned from it.", "time": "2013-08-25 18:36:12"}, {"content": "Actually in the Shire in Bilbo’s days it was, as a rule, only the richest and the poorest Hobbits that maintained the old custom.", "time": "2013-08-25 18:41:30"}, {"content": "All Hobbits were, in any case, clannish and reckoned up their relationships with great care. They drew long and elaborate family-trees with innumerable branches.", "time": "2013-08-25 18:46:29"}, {"content": "an astonishing habit: they imbibed or inhaled, through pipes of clay or wood, the smoke of the burning leaves of a herb, which they called pipe-weed or leaf, a variety probably of Nicotiana.", "time": "2013-08-25 18:49:02"}, {"content": "Nearly all Tooks still lived in the Tookland, but that was not true of many other families, such as the Bagginses or the Boffins.", "time": "2013-08-25 18:53:51"}, {"content": "The Shire at this time had hardly any ‘government’. Families for the most part managed their own affairs. Growing food and eating it occupied most of their time.", "time": "2013-08-25 18:54:49"}, {"content": "As mayor almost his only duty was to preside at banquets, given on the Shire-holidays, which occurred at frequent intervals.", "time": "2013-08-25 19:41:05"}, {"content": "Sixty years had passed since he set out on his memorable journey, and he was old even for Hobbits, who reached a hundred as often as not; but much evidently still remained of the considerable wealth that he had brought back.", "time": "2013-08-25 19:47:43"}, {"content": "As is told in The Hobbit, there came one day to Bilbo’s door the great Wizard, Gandalf the Grey, and thirteen dwarves with him: none other, indeed, than Thorin Oakenshield, descendant of kings, and his twelve companions in exile.", "time": "2013-08-25 19:49:17"}, {"content": "He possessed a secret treasure that had come to him long ages ago, when he still lived in the light: a ring of gold that made its wearer invisible. It was the one thing he loved, his ‘Precious’, and he talked to it, even when it was not with him.", "time": "2013-08-25 19:54:55"}, {"content": "For as he ran he put his hand in his pocket, and the ring slipped quietly on to his finger. So it was that Gollum passed him without seeing him, and went to guard the way out, lest the ‘thief ’ should escape.", "time": "2013-08-25 19:59:53"}, {"content": "In the end, gathering his courage, he leaped over Gollum in the dark, and fled away down the passage, pursued by his enemy’s cries of hate and despair: Thief, thief! Baggins! We hates it for ever!", "time": "2013-08-25 20:03:19"}, {"content": "Though he did not say so to Bilbo, he also thought it important, and disturbing, to find that the good hobbit had not told the truth from the first: quite contrary to his habit.", "time": "2013-08-25 20:07:44"}, {"content": "His sword, Sting, Bilbo hung over his fireplace, and his coat of marvellous mail, the gift of the Dwarves from the Dragon-hoard, he lent to a museum, to the Michel Delving Mathom-house in fact.", "time": "2013-08-26 10:58:33"}, {"content": "He returned to his home at Bag End on June the 22nd in his fifty-second year (S.R. 1342), and nothing very notable occurred in the Shire until Mr. Baggins began the preparations for the celebration of his hundred-and-eleventh birthday (S.R. 1401). At this point this History begins.", "time": "2013-08-26 10:57:49"}, {"content": "At that time Frodo was still in his tweens, as the hobbits called the irresponsible twenties between childhood and coming of age at thirty-three.", "time": "2013-08-26 21:35:29"}, {"content": "She was our Mr. Bilbo’s first cousin on the mother’s side (her mother being the youngest of the Old Took’s daughters); and Mr. Drogo was his second cousin. So Mr. Frodo is his first and second cousin, once removed either way, as the saying is, if you follow me.", "time": "2013-08-26 21:44:06"}, {"content": "At the end of the second week in September a cart came in through Bywater from the direction of Brandywine Bridge in broad daylight. An old man was driving it all alone. He wore a tall pointed blue hat, a long grey cloak, and a silver scarf. He had a long white beard and bushy eyebrows that stuck out beyond the brim of his hat.", "time": "2013-08-27 10:32:42"}, {"content": "That was Gandalf ’s mark, of course, and the old man was Gandalf the Wizard, whose fame in the Shire was due mainly to his skill with fires, smokes, and lights.", "time": "2013-08-27 17:41:40"}, {"content": "I don’t know half of you half as well as I should like; and I like less than half of you half as well as you deserve.", "time": "2013-08-27 20:53:31"}, {"content": "I want to see mountains again, Gandalf – mountains; and then find somewhere where I can rest. In peace and quiet, without a lot of relatives prying around, and a string of confounded visitors hanging on the bell. I might find somewhere where I can finish my book.", "time": "2013-08-28 16:01:23"}, {"content": "It was a fine night, and the black sky was dotted with stars. He looked up, sniffing the air. ‘What fun! What fun to be off again, off on the Road with dwarves! This is what I have really been longing for, for years!", "time": "2013-08-29 10:46:54"}, {"content": "He found himself wondering at times, especially in the autumn, about the wild lands, and strange visions of mountains that he had never seen came into his dreams. He began to say to himself: ‘Perhaps I shall cross the River myself one day.’", "time": "2013-08-30 11:49:43"}, {"content": "Elves, who seldom walked in the Shire, could now be seen passing westward through the woods in the evening, passing and not returning; but they were leaving Middle-earth and were no longer concerned with its troubles.", "time": "2013-08-30 11:51:45"}, {"content": "A mortal, Frodo, who keeps one of the Great Rings, does not die, but he does not grow or obtain more life, he merely continues, until at last every minute is a weariness. And if he often uses the Ring to make himself invisible, he fades: he becomes in the end invisible permanently, and walks in the twilight under the eye of the Dark Power that rules the Rings.", "time": "2013-08-31 18:19:00"}, {"content": "I could not take it from him without doing greater harm; and I had no right to do so anyway. I could only watch and wait. I might perhaps have consulted Saruman the White, but something always held me back.’", "time": "2013-08-31 18:26:03"}, {"content": "Nine he gave to Mortal Men, proud and great, and so ensnared them. Long ago they fell under the dominion of the One, and they became Ringwraiths, shadows under his great Shadow, his most terrible servants.", "time": "2013-08-31 20:31:48"}, {"content": "It was Gil-galad, Elven-king and Elendil of Westernesse who overthrew Sauron, though they themselves perished in the deed; and Isildur Elendil’s son cut the Ring from Sauron’s hand and took it for his own.", "time": "2013-09-02 11:22:02"}, {"content": "He was very pleased with his discovery and he concealed it; and he used it to find out secrets, and he put his knowledge to crooked and malicious uses.", "time": "2013-09-02 21:03:12"}, {"content": "So he journeyed by night up into the highlands, and he found a little cave out of which the dark stream ran; and he wormed his way like a maggot into the heart of the hills, and vanished out of all knowledge. The Ring went into the shadows with him, and even the maker, when his power had begun to grow again, could learn nothing of it.’", "time": "2013-09-03 10:45:59"}, {"content": "So now, when its master was awake once more and sending out his dark thought from Mirkwood, it abandoned Gollum. Only to be picked up by the most unlikely person imaginable: Bilbo from the Shire!", "time": "2013-09-03 10:54:56"}, {"content": "Alas! Mordor draws all wicked things, and the Dark Power was bending all its will to gather them there.", "time": "2013-09-04 11:30:30"}, {"content": "What a pity that Bilbo did not stab that vile creature, when he had a chance!’", "time": "2013-09-04 21:01:29"}, {"content": "Many that live deserve death. And some that die deserve life. Can you give it to them?", "time": "2013-09-04 21:19:44"}, {"content": "Hobbits really are amazing creatures, as I have said before. You can learn all that there is to know about their ways in a month, and yet after a hundred years they can still surprise you at a pinch.", "time": "2013-09-05 21:15:55"}], "duokanbookid": "j5b3c49d4d7d42c5024ceb914c61d8g3", "title": "The Lord of the Rings: The Fellowship of the Ring"}