{"date": "2013-09-07", "source": "0147f2f9-c3ec-4761-923d-6f52acf809f5.html", "notes": [{"content": "希腊人的观点：这是一个简单、符合逻辑、能以数学表达的世界。基督教的观点：这是个邪恶的世界，唯有耶稣能拯救它。日耳曼蛮族的观点则是：打仗是好玩的事。这些看似天差地远的元素组合在一起，造就了欧洲的文明。", "time": "2013-09-07 17:14:47"}, {"content": "罗马帝国曾经遭到三次大规模侵略。第一次的侵略者是日耳曼蛮族，继而是穆斯林（指伊斯兰教徒），再来是北欧人，或称维京人", "time": "2015-10-06 17:37:36"}, {"content": "当我们谈到罗马帝国的灭亡，总会给它一个年份：公元476年。不过，这一年灭亡的只有西罗马帝国；说希腊语的东罗马帝国以君士坦丁堡为首都，又继续存在了一千年", "time": "2015-10-06 17:37:47"}, {"content": "日耳曼蛮族也曾于公元3世纪多次来犯，差点就亡了罗马帝国。当时罗马政权风雨飘摇，许多皇帝才上台就下台，根本无力抵挡外侮，结果，帝国虽得以苟延残喘，但境内多处已成了日耳曼人的定居地。君士坦丁大帝，也就是公元313年正式宣布支持基督教的罗马皇帝，在这次战乱后力图整顿，希望重振帝国荣光", "time": "2015-10-06 17:41:30"}, {"content": "日耳曼民族并没有接掌罗马帝国的欲望。他们只是侵略者，却不想成为征服者。他们只想分一杯羹，在这块土地上安定下来，过点舒服的日子，所以他们愿意承认罗马帝王的统治。", "time": "2015-10-06 17:42:00"}, {"content": "这是公元476年发生的事，不是什么波澜壮阔的最后战役。这位日耳曼领袖叫做奥多亚克（Odoacer），他接掌了帝国，但并没有自封为帝，而是自称意大利国王。他把西罗马帝国的王权象征——皇冠和王袍——包好，送到还有另一位皇帝在位的君士坦丁堡去，等于承认了那位皇帝的治权。日耳曼人沐浴在荣耀之中，这是他们无心插柳下的征服。", "time": "2015-10-06 17:43:08"}, {"content": "罗马人判决有罪无罪是以证据和证人为准，日耳曼民族则是用火烧、水淹等酷刑或打仗。例如，把嫌疑犯的手臂泡在沸水里，如果三天后这只手臂没有痊愈，这人就是有罪；或是把犯人丢进水里，浮起来就是有罪，沉下去就是无罪。双方若是因土地起争执可以开战，打胜的一方可以名正言顺宣称所有权。", "comment": "有趣的日耳曼民族", "time": "2015-10-06 17:51:09"}, {"content": "在这方面，罗马教廷走的一直是日耳曼路线，直到12世纪，教会受到被挖掘出土的《查士丁尼法典》影响，告诫神职人员不得参与酷刑，情况才有了改变。", "time": "2015-10-06 17:52:37"}, {"content": "日耳曼人入侵没多久就转而皈依为基督徒，否定了他们原有的神明或在入侵前曾经改奉的阿里乌教派（Arianism）。阿里乌教派是基督教一支被视为异端的流派，主要教义是认为耶稣既是上帝的儿子，各方面势必逊于天父，无法与上帝相提并论。这派主张曾在东罗马帝国风行过一段时间，之后被传教士带到日耳曼，许多日耳曼人因而成为该教派信徒。\n因此，“罗马的灭亡”在许多方面都有误导之嫌，而最让人误会的是宗教方面——罗马帝国的国教和教廷其实都幸存下来，甚至受到侵略者的拥抱。这是个起始点，欧洲文明就此奠基。对此我们前面已经做过表述：日耳曼人支持罗马基督教会，而罗马教会保存了古希腊罗马的学术。", "comment": "欧洲文明就此奠基？之前的古典时代不算欧洲？", "time": "2015-10-06 17:56:01"}, {"content": "“法兰西”（France，即法国）这个名字即是法兰克（Franks）的衍生词，因此法国也是源起于日耳曼民族。法兰克王国于查理大帝（Charles the Great或Charlemagne）在位期间到达鼎盛，他死后王国便告分裂", "time": "2015-10-06 17:57:27"}, {"content": "之后，盎格鲁（Angles）、萨克森（Saxons）和朱特（Jutes）这几支日耳曼民族于5世纪和6世纪跨过海峡入侵英格兰。这一回比较像全面的征服；英国人惨遭倾轧，只有苏格兰、威尔士和英格兰西南部康瓦耳郡（Cornwall）等地逃过一劫", "time": "2015-10-06 17:59:04"}, {"content": "如此，整个英格兰变成了日耳曼社会；除了众多独立王国林立，它也成了异教之邦，因为盎格鲁、萨克森和朱特族并不信奉任何流派的基督教。后来爱尔兰和罗马的传教士来到英格兰，将这些新移民感召成基督徒。关于英国的宗教改奉，爱尔兰扮演了重要角色，为基督教的存续留下一则动人的篇章。", "time": "2015-10-06 18:00:12"}, {"content": "第二次的大侵略来自穆斯林，时为7世纪到8世纪，距离日耳曼蛮族入侵仅仅两百年。伊斯兰教始祖穆罕默德原为阿拉伯商人，得到神的天启后创立该教。他这支借由神助发展出来的宗教，与犹太教和基督教有紧密联系；穆斯林也承认耶稣和耶稣之前的先知们确实是先知，但深信穆罕默德是世上最后一位先知，能指引大家走向唯一真神安拉的怀抱", "time": "2015-10-06 18:04:30"}, {"content": "穆罕默德死后，他的信徒继续南征北讨，势如破竹。他们马不停蹄，征服了其他部落也建立了国邦，先是在波斯帝国地区，后来是东罗马帝国的中东及北非区域。他们沿着北非继续西进，不但让日耳曼蛮族侵略者所建的王国陷落，之后更越海进入西班牙。", "time": "2015-10-06 18:07:04"}, {"content": "西班牙原是罗马帝国的一个省份，后来被西哥特人（Visigoths）入侵，成为基督教国家，如今变成了伊斯兰教国家。", "time": "2015-10-06 18:07:15"}, {"content": "在伊斯兰教的统治下，西班牙成了中世纪欧洲最文明的区域。不识字的阿拉伯蛮族南征北讨，一路上向他们征服的民族学习，包括拥有高度文明的波斯人，和拜占庭帝国的希腊人。", "time": "2015-10-06 18:08:07"}, {"content": "现在，我们要对这二次征战的结果做个归纳。第一，在西欧，日耳曼民族、古罗马和基督教因此熔于一炉。第二，整个英格兰被日耳曼蛮族占领，之后又回归基督教信仰。第三，在伊斯兰世界（中东、北非和西班牙），基督教完全隐没，但希腊学术被保存下来，且被传播到欧洲。", "time": "2015-10-06 18:09:20"}, {"content": "■维京人横行两百年\n维京人，又称诺曼人、北欧人，是最后一批侵略者，在9世纪和10世纪，也就是继伊斯兰进占后的两个世纪，横行于整个欧洲。维京人的老家在北方——瑞典、挪威、丹麦，取道海上来袭。他们的巨大长船委实是个惊人景象，这些船吃水甚浅，只需一米深的水即可浮起，因此可以长途远航，溯河而上。河水变浅，他们就放下携载于长船上的小舟，继续航行；遇到障碍，就抬着船只绕过屏障，继续前划。如此这般，他们能够深入内陆；在俄国境内，从波罗的海直到黑海都有他们的踪迹。", "time": "2015-10-06 20:12:35"}, {"content": "维京人之所以能不断进袭却没有遭受抵抗，是因为政府力薄势弱。它们没有正常的征税体制，即使有能力整合成军，侵略者也不是从陆路来袭。西欧的小王国没有一个设有海军，查理大帝麾下从来不曾有过海军编制，再说他的帝国如今已烟消云散。", "time": "2015-10-06 20:14:13"}, {"content": "一段时间后，维京人把妻小都带了来，在这里建立了永久的家园。地图上可以看到他们的聚落，广布在俄国、法国北部、英格兰和爱尔兰。都柏林原本是北欧人的城市，英国遭受过两次侵略，第一次是盎格鲁、萨克森和朱特族，之后是从本岛东边进来的维京人。这两组人马说的都是日耳曼语言，英语就是从它演变而来。法国北方有个移民区叫做诺曼底（Normandy），就是因为维京人（又称诺曼人）在此定居而得名。法兰西国王让他们住在这里，条件是要停止掠夺的勾当。", "comment": "诺曼底位于法国北部，诺曼公爵是维京人", "time": "2015-10-06 20:18:25"}, {"content": "诺曼人在法国北部定居百年之后，诺曼底公爵威廉带领一些随从于1066年征服了英国，这只是上层阶级的换手；威廉公爵和他的随众开始以英国的新统治者自居。诺曼人说他们自己的一种法语，之后融合各方语言，最后变成了英语。英国社会到处都是侵略者，不过1066年后就不再有外族入侵。", "comment": "1066年，英国被说法语的诺曼人侵占，英语最终形成", "time": "2015-10-06 20:20:48"}, {"content": "基督教世界的首要任务，是把穆斯林赶回他们的老家。这几次运动动员了整个欧洲，一开始是为了收复西班牙，继而以夺回圣地耶路撒冷为目标。收复西班牙的行动始于11世纪，经过四百余年才大功告成", "time": "2015-10-06 20:29:13"}, {"content": "十字军于1095年开始东征圣地，持续攻伐了将近两个世纪。想想看，当这些基督徒知道耶稣当年的传道之所、葬身之地如今落在离经叛道的异教徒手里，而且这些异教徒还处处与基督教为敌，势必群情激奋，认为上帝一定希望他们洗刷这样的奇耻大辱。对于这些圣战，教皇不只鼓励，更予以奖励。不过，这些征战只有第一次获得成功", "time": "2015-10-06 20:30:21"}, {"content": "十字军是多国合作的成果，对比之下，从15世纪开始跨海朝美洲和亚洲发展的扩张，则是几个新兴民族国家间的竞赛——首先是西班牙和葡萄牙，接着是英国、法国和荷兰。这些国家的首要目标是取得亚洲的香料与财富。它们兵分两路：以海路绕过非洲南部，或是跨过大西洋直接西进", "time": "2015-10-06 20:31:47"}, {"content": "来自亚洲的奢侈品很早便已传入欧洲，不过都是经由拜占庭帝国的首都君士坦丁堡辗转而来。欧洲人改采海路，部分原因是陆上的东通之路已经落在穆斯林的手里。", "time": "2015-10-06 20:32:47"}, {"content": "7世纪到8世纪，一大块疆土被阿拉伯的伊斯兰教侵略者夺走，9世纪，土耳其人借道亚洲大草原接踵而至。他们从东罗马帝国手中夺取了现在称为土耳其的地方，并于南进和西征途中纷纷改信伊斯兰教，整个中东都落入他们的手中。他们并且翻山越海来到欧洲，君士坦丁堡周遭的领土相继失陷，四面楚歌。1453年，土耳其人终于攻占了东罗马帝国的首都", "comment": "阿拉伯人和土耳其人", "time": "2015-10-06 20:34:47"}, {"content": "6世纪时由查士丁尼大帝所建的圣索菲亚大教堂（Hagia Sophia，意为“天主的上智”），被改建为伊斯兰教的清真寺。土耳其人本身也建立了一个帝国，称为奥斯曼帝国。这个帝国于第一次世界大战后画下了休止符，当今的土耳其就此成为一个世俗国家，虽然绝大部分的人口还是信奉伊斯兰教", "time": "2015-10-06 20:37:08"}, {"content": "君士坦丁堡陷落后，当初将古希腊学术保存下来并仔细研读的基督教学者，亲自带着这些珍贵手稿逃到了意大利。他们在此受到热烈欢迎，因为文艺复兴学者正四处搜寻古典文献", "time": "2015-10-06 20:37:48"}, {"content": "有些希腊学术以拉丁原文继续传世，而虽然整个罗马文学深受希腊人影响，但这些希腊原文作品是在间隔很久并且绕了极远的路之后——中世纪的西班牙以及15世纪的君士坦丁堡——才抵达了西欧。", "time": "2015-10-06 21:00:28"}, {"content": "洛克的主张是：依据罗马自然法的观念，每个人都拥有与生俱来的生存权、财产权和自由权，而透过政府的成立，人民有如和政府签下契约：人民授予政府权力，为的是让自己的权利得到保护；如果政府不能保护人民的这些权利，人民有权解散政府，重新建立新的政府。过去有关国王如神祇一般的地位、臣民服从君命的义务，这些观念通通都被扫到一边，成立政府已与签订一纸商业契约无异。", "time": "2013-09-07 17:17:09"}, {"content": "近代欧洲在经济上爆发力十足，智识生活百家争鸣，皆是基于一个事实：不管是好是坏，从来没有一个单一强权掌控过它、形塑过它。它多元的历史遗产因此能被充分发掘、延伸；希腊的数学观念在科学革命时期得到实现，从而建立起科技创新的一个新基础。", "time": "2013-09-07 17:18:16"}], "duokanbookid": "e9f14f9849fb4972a2287451d1aad98b", "title": "极简欧洲史"}