{"date": "2013-10-03", "source": "8686968a-736b-4054-bc37-a3347f6a64b0.html", "notes": [{"content": "explicitly", "time": "2013-10-03 15:21:33"}, {"content": "MapReduce operatesonly at the higher level: the programmer thinks in terms of functions of key and valuepairs, and the data flow is implicit", "time": "2013-10-03 15:20:03"}, {"content": "Although Hadoop is best known for MapReduce and its distributed filesystem (HDFS,renamed from NDFS), the term is also used for a family of related projects that fallunder the umbrella of infrastructure for distributed computing and large-scale dataprocessing.", "time": "2013-10-04 13:49:21"}, {"content": "When moving from one release to another you need to consider the upgrade steps thatare needed. There are several aspects to consider: API compatibility, data compatibility,and wire compatibility.", "time": "2013-10-04 13:54:17"}, {"content": "HDFS is a filesystem designed for storing very large files with streaming data accesspatterns, running on clusters of commodity hardware.\n1 Let’s examine this statementin more detail:", "time": "2013-10-04 13:57:20"}, {"content": "While this may change in the future, these are areas where HDFS is not a good fit today:\nLow-latency data access", "time": "2013-10-04 13:58:19"}, {"content": "Lots of small files", "time": "2013-10-04 13:58:25"}, {"content": "Multiple writers, arbitrary file modifications", "time": "2013-10-04 13:58:29"}, {"content": "A disk has a block size, which is the minimum amount of data that it can read or write.Filesystems for a single disk build on this by dealing with data in blocks, which are anintegral multiple of the disk block size.", "time": "2013-10-04 14:01:48"}, {"content": "HDFS, too, has the concept of a block, but it is a much larger unit—64 MB by default.Like in a filesystem for a single disk, files in HDFS are broken into block-sized chunks,which are stored as independent units.", "time": "2013-10-04 14:01:58"}, {"content": "HDFS blocks are large compared to disk blocks, and the reason is to minimize the costof seeks. By making a block large enough, the time to transfer the data from the diskcan be made to be significantly larger than the time to seek to the start of the block.Thus the time to transfer a large file made of multiple blocks operates at the disk transferrate.", "time": "2013-10-04 14:05:03"}, {"content": "Having a block abstraction for a distributed filesystem brings several benefits. The firstbenefit is the most obvious: a file can be larger than any single disk in the network.", "time": "2013-10-04 14:06:52"}, {"content": "Second, making the unit of abstraction a block rather than a file simplifies the storagesubsystem.", "time": "2013-10-04 14:07:31"}, {"content": "Furthermore, blocks fit well with replication for providing fault tolerance and availa-bility.", "time": "2013-10-04 14:08:30"}, {"content": "The namenode manages thefilesystem namespace. It maintains the filesystem tree and the metadata for all the filesand directories in the tree. This information is stored persistently on the local disk inthe form of two files: the namespace image and the edit log. The namenode also knowsthe datanodes on which all the blocks for a given file are located, however, it doesnot store block locations persistently, since this information is reconstructed fromdatanodes when the system starts", "time": "2013-10-04 14:11:42"}, {"content": "It is also possible to run a secondary namenode, which despite its name does not act asa namenode. Its main role is to periodically merge the namespace image with the editlog to prevent the edit log from becoming too large.", "time": "2013-10-04 14:14:32"}, {"content": "A MapFile is a sorted SequenceFile with an index to permit lookups by key. MapFile canbe thought of as a persistent form of java.util.Map (although it doesn’t implement thisinterface), which is able to grow beyond the size of a Map that is kept in memory.", "time": "2013-10-04 15:05:42"}], "duokanbookid": "tf37935b30fb827d52cddf8g92d085cb", "title": "Hadoop The Definitive Guide, 3nd Edition"}