{"date": "2014-03-30", "source": "ba4d763e-ba41-4851-a060-bfe41533d413.html", "notes": [{"content": "You are reading about GNU Emacs, the GNU incarnation of the advanced, self-documenting, customizable, extensible editor Emacs.\n(The ‘G’ in ‘GNU’ is notsilent.)", "time": "2014-03-30 03:54:53"}, {"content": "On a text terminal, Emacs occupies the entire terminal screen. Wewill use the term frame to mean a graphical window or terminal screen occupied by Emacs.Emacs behaves very similarly on both kinds of frames.", "time": "2014-03-30 03:56:52"}, {"content": "The main area of the frame, below the tool bar (if one exists) and above the echo area, iscalled the window.", "time": "2014-03-30 03:58:20"}, {"content": "The cursor in the selected window shows the location where most editing commands takeeffect, which is called point", "time": "2014-03-30 04:02:15"}, {"content": "The echo area is also used to display the minibuffer, a special window where you caninput arguments to commands, such as the name of a file to be edited", "time": "2014-03-30 10:58:35"}, {"content": "The text displayed in the mode line has the following format:cs:ch-fr buf\npos line\n(major minor)", "time": "2014-03-30 11:04:27"}, {"content": "The next element on the mode line is the string indicated by ch. This shows two dashes(‘--’) if the buffer displayed in the window has the same contents as the corresponding fileon the disk; i.e., if the buffer is “unmodified”. If the buffer is modified, it shows two stars(‘**’). For a read-only buffer, it shows ‘%*’ if the buffer is modified, and ‘%%’ otherwise.", "time": "2014-03-30 11:02:12"}, {"content": "fr gives the selected frame name (see Chapter 18 [Frames], page 157). It appears onlyon text terminals. The initial frame’s name is ‘F1’.", "time": "2014-03-30 11:01:05"}, {"content": "pos tells you whether there is additional text above the top of the window, or below thebottom. If your buffer is small and all of it is visible in the window, pos is ‘All’. Otherwise,", "time": "2014-03-30 11:04:04"}, {"content": "it is ‘Top’ if you are looking at the beginning of the buffer, ‘Bot’ if you are looking at theend of the buffer, or ‘nn%’, where nn is the percentage of the buffer above the top of thewindow", "time": "2014-03-30 11:04:13"}, {"content": "On a text terminal, you can use the menu bar by typing M-‘ or F10 (these run thecommand tmm-menubar). This lets you select a menu item with the keyboard.", "time": "2014-03-30 11:08:52"}, {"content": "The text you are editing in Emacs resides in an object called a buffer. Each time you visita file, a buffer is used to hold the file’s text. Each time you invoke Dired, a buffer is usedto hold the directory listing. If you send a message with C-x m, a buffer is used to holdthe text of the message. When you ask for a command’s documentation, that appears in abuffer named *Help*.", "time": "2014-03-30 11:24:56"}, {"content": "A newly started Emacs has severalbuffers, including one named *scratch*, which can be used for evaluating Lisp expressionsand is not associated with any file", "time": "2014-03-30 11:25:48"}, {"content": "At any time, one and only one buffer is selected; we call it the current buffer. Wesometimes say that a command operates on “the buffer”; this really means that it operateson the current buffer.", "time": "2014-03-30 11:26:49"}, {"content": "These are stored in buffer-local variables—variables that can have a different value in each buffer.", "time": "2014-03-30 11:29:00"}, {"content": "C-x LEFT Select the previous buffer in the buffer list (previous-buffer).C-x RIGHT Select the next buffer in the buffer list (next-buffer).", "time": "2014-03-30 11:30:50"}, {"content": "To select a buffer in a window other than the current one, type C-x 4 b (switch-to-buffer-other-window). This prompts for a buffer name using the minibuffer, displays thatbuffer in another window, and selects that window.", "time": "2014-03-30 11:32:30"}, {"content": "To display a list of existing buffers, type C-x C-b. Each line in the list shows one buffer’sname, major mode and visited file. The buffers are listed in the order that they werecurrent; the buffers that were current most recently come first.", "time": "2014-03-30 11:34:40"}, {"content": ".’ in the first field of a line indicates that the buffer is current. ‘%’ indicates a read-onlybuffer. ‘*’ indicates that the buffer is “modified”. If several buffers are modified, it may betime to save some with C-x s", "time": "2014-03-30 11:34:21"}, {"content": "M-x rename-uniquely renames the current buffer to a similar name with a numeric suffixadded to make it both different and unique. This command does not need an argument.It is useful for creating multiple shell buffers: if you rename the *shell* buffer, then doM-x shell again, it makes a new shell buffer named *shell*; meanwhile, the old shellbuffer continues to exist under its new name", "time": "2014-03-30 11:37:14"}, {"content": "The command M-x kill-matching-buffers prompts for a regular expression and killsall buffers whose names match that expression.", "time": "2014-03-30 11:40:45"}, {"content": "If you run one Emacs session for a period of days, as many people do, it can fill upwith buffers that you used several days ago. The command M-x clean-buffer-list is aconvenient way to purge them; it kills all the unmodified buffers that you have not used fora long time", "time": "2014-03-30 11:42:21"}, {"content": "The Buffer Menu opened by C-x C-b (see Section 16.2 [List Buffers], page 144) does notmerely list buffers. It also allows you to perform various operations on buffers, throughan interface similar to Dired (see Chapter 27 [Dired], page 307). You can save buffers, killthem (here called deleting them, for consistency with Dired), or display them.", "time": "2014-04-02 00:28:29"}, {"content": "x\nPerform all flagged deletions and saves (Buffer-menu-execute", "time": "2014-04-02 00:27:50"}, {"content": "If you have created, deleted or renamed buffers,the way to update *Buffer List* to show what you have done is to type g (revert-buffer).", "time": "2014-04-02 00:32:58"}, {"content": "When one of these commands prompts you for a buffer name, you can type in just asubstring of the name you want to choose. As you enter the substring, Iswitchb modecontinuously displays a list of buffers that match the substring you have typed.", "time": "2014-04-02 00:35:39"}, {"content": "To enable Iswitchb mode, type M-x iswitchb-mode, or customize the variable iswitchb-mode to t", "time": "2014-04-02 00:36:25"}, {"content": "M-x bs-show pops up a buffer list similar to the one normally displayed by C-x C-bbut which you can customize. If you prefer this to the usual buffer list, you can bindthis command to C-x C-b. To customize this buffer list, use the bs Custom group", "time": "2014-04-02 00:37:39"}, {"content": "A single buffer may appear inmore than one window; if it does, any changes in its text are displayed in all the windowswhere it appears. But these windows can show different parts of the buffer, because eachwindow has its own value of point", "time": "2014-04-02 00:38:47"}, {"content": "C-x 4 is a prefix key for a variety of commands that switch to a buffer in a different window—either another existing window, or a new window created by splitting the selected window.See Section 17.6.1 [Window Choice], page 155, for how Emacs picks or creates the windowto use.", "time": "2014-04-03 01:03:21"}, {"content": "You can also use C-x + (balance-windows) to even out the heights of all the windowsin the selected frame.", "time": "2014-04-03 01:04:27"}, {"content": "Commands with names ending in -other-window behave like display-buffer, exceptthat they never display in the selected window. Several of these commands are bound inthe C-x 4 prefix key", "time": "2014-04-03 01:07:36"}, {"content": "Follow mode (M-x follow-mode) synchronizes several windows on the same buffer sothat they always display adjacent sections of that buffer", "time": "2014-04-03 01:11:26"}, {"content": "TEX mode has four variants: Plain TEX mode, L\nA\nTEX mode, DocTEX mode, and SliTEXmode. These distinct major modes differ only slightly, and are designed for editing the fourdifferent formats. Emacs selects the appropriate mode by looking at the contents of thebuffer.", "time": "2014-04-03 01:13:37"}, {"content": "M-x compileRun a compiler asynchronously under Emacs, with error messages going to the*compilation* buffer.", "time": "2014-03-28 02:17:03"}], "duokanbookid": "v685008147b79cd617765f2399e95b90", "title": "GNU Emacs Manual"}