{"date": "2014-03-08", "source": "174a27d1-4c31-49ac-a264-4d925aafa834.html", "notes": [{"content": "Creating a ZooKeeper SessionThe ZooKeeper API is built around a ZooKeeper handle that is passed to every API call.This handle represents a session with ZooKeeper. As shown in Figure 3-1, a session thatis established with one ZooKeeper server will migrate to another ZooKeeper server ifits connection is broken. As long as the session is alive, the handle will remain valid,and the ZooKeeper client library will continually try to keep an active connection to aZooKeeper server to keep the session alive. If the handle is closed, the ZooKeeper client", "time": "2014-03-08 10:49:16"}, {"content": "library will tell the ZooKeeper servers to kill the session. If ZooKeeper decides that aclient has died, it will invalidate the session. If a client later tries to reconnect to a Zoo‐Keeper server using the handle that corresponds to the invalidated session, the Zoo‐Keeper server informs the client library that the session is no longer valid and the handlereturns errors for all operations.", "time": "2014-03-08 10:49:25"}, {"content": "sessionTimeoutThe time in milliseconds that ZooKeeper waits without hearing from the clientbefore declaring the session dead", "time": "2014-03-08 02:47:07"}, {"content": "Zoo‐Keeper sessions typically have a timeout of 5–10 seconds", "time": "2014-03-08 02:47:21"}, {"content": "Each watch is associated with the session in which the client sets it. If the session expires,pending watches are removed.", "time": "2014-03-08 10:23:43"}, {"content": "Miss‐ing events is typically not a problem because any changes that have occurred during theperiod between receiving a notification and registering a new watch can be captured byreading the state of ZooKeeper directly", "time": "2014-03-08 10:16:50"}, {"content": "Hereis a list of tasks that require a component to wait for changes:• Mastership changes• Master waits for changes to the list of workers• Master waits for new tasks to assign• Worker waits for new task assignments• Client waits for task execution result", "time": "2014-03-08 10:33:43"}], "duokanbookid": "mb47f6eb649ffed7g8dgecbcb49gg16e", "title": "Zookeeper: Distributed Process Coordination"}