{"date": "2015-05-17", "source": "d6f028e0-5b8f-4363-9221-5ba936c8d534.html", "notes": [{"content": "Written feedback is submitted to a hiring committee (HC) of engineers and managersto make a hire / no-hire recommendation. Feedback is typically broken down into fourcategories (Analytical Ability, Coding, Experience, and Communication) and you aregiven an overall score from 1.0 to 4.0.", "time": "2015-05-17 21:35:45"}, {"content": "To extend an offer, the HC wants tosee at least one interviewer who isan \"enthusiastic endorser.\" In otherwords, a packet with scores of 3.6,3.1,3.1 and 2.6 is better than all 3.1", "time": "2015-05-17 21:37:28"}, {"content": "Writing Strong BulletsFor each role, try to discuss your accomplishments with the following approach:\"Accom-plished X by implementing Y which led to Z.\" Here's an example:• \"Reduced object rendering time by 75% by implementing distributed caching,leading to a 10% reduction in log-in time.\"Here's another example with an alternate wording:• \"Increased average match accuracy from 1.2 to 1.5 by implementing a new compar-ison algorithm based on windiff.\"", "comment": "一人hold住了xx传输业务。项目规模，多少万节点。将百度的xx从批量变为实时。独立支持凤巢网盟的xx离线业务，每秒实时xG流量。", "time": "2015-05-17 21:47:47"}, {"content": "The projects should include your 2 - 4 most significant projects. State what the projectwas and which languages or technologies it employed", "time": "2015-05-17 21:53:31"}, {"content": "Advice for Non-Native English Speakers and InternationalsSome companies will throw out your resume just because of a typo. Please get at leastone native English speaker to proofread your resume.", "time": "2015-05-17 21:55:56"}, {"content": "I recommend filling in thefollowing \"preparation grid\"as shown below:\nCommon QuestionsMost ChallengingWhat You LearnedMost InterestingHardest BugEnjoyed MostConflicts with Teammates\nProject 1\nProject 2\nProject 3\nProject 4", "time": "2015-05-17 22:08:35"}, {"content": "A better answerconveys a real, legitimate weakness but emphasizes how you work to overcome it.", "time": "2015-05-17 22:13:16"}, {"content": "What was the most challenging part of that project?", "time": "2015-05-18 22:42:43"}, {"content": "Genuine QuestionsThese are the questions you actually want to know the answers to. Here are a few ideasof questions that are valuable to many candidates:1. \"How much of your day do you spend coding?\"2. \"How many meetings do you have every week?\"3. \"What is the ratio of testers to developers to program managers? What is the interac-tion like? How does project planning happen on the team?", "time": "2015-05-18 22:45:23"}, {"content": "Insightful QuestionsThese questions are designed to demonstrate your deep knowledge of programmingor technologies, and they also demonstrate your passion for the company or product.1. \"I noticed that you use technology X. How do you handle problem Y?\"2. \"Why did the product choose to use the X protocol over the Y protocol? I know it has", "time": "2015-05-18 22:44:47"}, {"content": "Passion QuestionsThese questions are designed to demonstrate your passion for technology. They showthat you're interested in learning and will be a strong contributor to the company.1. \"I'm very interested in scalability. Did you come in with a background in this, or whatopportunities are there to learn about it?\"2. \"I'm not familiar with technology X, but it sounds like a very interesting solution.Could you tell me a bit more about how it works?", "time": "2015-05-18 22:45:59"}, {"content": "• Candidate #1: \"I basically did all the hard work for the team.\"• Candidate #2:\"l implemented the file system, which was considered one of the mostchallenging components because...\"Candidate #2 not only sounds more impressive, but she also appears less arrogant.", "time": "2015-05-18 22:51:13"}, {"content": "Stay light on details and just statethe key points. That is, consider something like this: \"By examining the most commonuser behavior and applying the Rabin-Karp algorithm, I designed a new algorithm toreduce search from 0(n) to 0(log n) in 90% of cases. I can go into more details ifyou'd like.'This demonstrates the key points while letting your interviewer ask for moredetails if he wants to", "time": "2015-05-18 22:53:05"}, {"content": "Give Structured AnswersThere are two common ways to think about structuring responses to a behavioral ques-tion: nugget first and S.A.R.. These techniques can be used separately or in together", "time": "2015-05-18 22:55:59"}, {"content": "4. Type your paper code as-is into a computer. You will probably make a bunch ofmistakes. Start a list of all the errors you make so that you can keep these in mind inthe real interview", "time": "2015-05-19 01:19:44"}, {"content": "Data StructuresLinked ListsBinary TreesTriesStacksQueuesVectors / ArrayListsHash Tables\nAlgorithmsBreadth First SearchDepth First SearchBinary SearchMerge SortQuicksortTree Insert/ Find /e.t.c\nConceptsBit ManipulationSingleton Design PatternFactory Design PatternMemory (Stack vs. Heap)RecursionBig-OTime\nFor each of the topics above, make sure you understand how to use and implementthem and, where applicable, what the space and time complexity is.", "time": "2015-05-19 01:21:28"}, {"content": "Power of 2\n78101620303240\nExact Value (X)\n128256102465,5361,048,5761,073,741,8244,294,967,2961,099,511,627,776\nApprox. Value\n1 thousand\n1 million1 billion\n1 trillion\nX Bytes into MB,GB, e.t.c.\n1 K64 K1 MB1 GB4GB1TBUsing this table, you could easily compute, for example, that a hash table mappingevery 32-bit integer to a boolean value could fit in memory on a single machin", "time": "2015-05-19 01:25:19"}, {"content": "So when you get a hard question, don't panic. Just start talking aloud about how youwould solve it. Show your interviewer how you're tackling the problem so that hedoesn't think you're stuck.", "time": "2015-05-19 01:27:52"}, {"content": "Five Steps to a Technical QuestionA technical interview question can be solved utilizing a five step approach:1. Ask your interviewer questions to resolve ambiguity.2. Design an Algorithm.3. Write pseudocode first, but make sure to tell your interviewer that you'll eventuallywrite \"real\" code.4. Write your code at a moderate pace.5. Test your code and carefully fix any mistakes.", "time": "2015-05-19 01:29:55"}, {"content": "Good questions might be ones like: What are the data types? How much data is there?What assumptions do you need to solve the problem? Who is the user?", "time": "2015-05-19 01:32:26"}, {"content": "When you notice problems in your code, really think deeply about why your code failedbefore fixing the mistake. You'll create beautiful, clean code much, much faster.", "time": "2015-05-19 01:37:15"}, {"content": "Approach I: ExamplifyWe'll start with an approach you are probably familiar with, even if you've never seen itlabeled. Under Examplify, you write out specific examples of the problem and see if youcan derive a general rule from there", "time": "2015-05-19 01:39:25"}, {"content": "We do recommend, however, studying up on basic C++ syntax so that youcan approach these questions with ease.", "time": "2015-03-07 13:12:05"}, {"content": "As in the earlier example, since p is a Person, the destructor for the Person class iscalled.This is problematic because the memory for Student may not be cleaned up.To fix this, we simply define the destructor for Person to be virtual.", "time": "2015-03-07 13:14:33"}, {"content": "A reference is another name (an alias) for a pre-existing object and it does not havememory of its own", "comment": "引用是否占用空间？占用的话，字节数是否等同于指针？", "time": "2015-03-07 13:24:55"}, {"content": "Templates are a way of reusing code to apply the same class to different data types", "time": "2015-03-10 17:15:58"}, {"content": "final keywordThe final keyword in Java has a different meaning depending on whether it is appliedto a variable, class or method", "time": "2015-03-10 17:28:52"}, {"content": "• Variable:The value cannot be changed once initialized.• Method:The method cannot be overridden by a subclass.• C/oss.-The class cannot be subclassed.", "time": "2015-03-10 17:29:10"}, {"content": "The finally keyword is used in association with a try/catch block and guaranteesthat a section of code will be executed, even if an exception is thrown. The finallyblock will be executed after the try and catch blocks, but before control transfers backto its origin", "comment": "final与finally我差点弄混了", "time": "2015-03-10 17:33:08"}, {"content": "The automatic garbage collector calls the finalize() method just before actuallydestroying the object. A class can therefore override the f inalize() method from theObject class in order to define custom behavior during garbage collection", "comment": "又来一个跟final像的，这个跟垃圾回收相关", "time": "2015-03-10 17:36:19"}, {"content": "Overloading is a term used to describe when two methods have the same name butdiffer in the type or number of arguments", "time": "2015-03-10 17:37:45"}, {"content": "Overriding, however, occurs when a method shares the same name and function signa-ture as another method in its super class.", "time": "2015-03-10 17:37:51"}, {"content": "ArrayList: An ArrayList is a dynamically resizing array, which grows as you insertelements.1 ArrayList<String> myArr = new ArrayList<String>();", "time": "2015-03-10 17:39:14"}, {"content": "Vector: A vector is very similar to an ArrayList, except that it is synchronized. Itssyntax is almost identical as well.1 Vector<String> myVect = new Vector<String>();", "comment": "这么说，vector是线程安全的", "time": "2015-03-10 17:39:55"}, {"content": "LinkedList: LinkedList is, of course, Java's built-in LinkedList class. Though itrarely comes up in an interview, it's useful to study because it demonstrates some of thesyntax for an iterator", "time": "2015-03-10 17:40:54"}, {"content": "HashMap:The HashMap collection is widely used, both in interviews and in the realworld. We've provided a snippet of the syntax below.1 HashMap<String, String> map = new HashMap<String, String>();", "time": "2015-03-10 17:42:51"}, {"content": "Developers commonly use both the implicit join and the explicit join in SQL queries.Both syntaxes are shown below.", "comment": "我一直是用隐式join，以至于我已经忘却了我在使用join", "time": "2015-03-10 17:45:13"}, {"content": "Normalized databases are designed to minimize redundancy, while denormalized data-bases are designed to optimize read time.", "comment": "我在工作中，喜欢用非正规的（即带冗余的）表设计", "time": "2015-03-10 17:47:38"}, {"content": "rotation", "comment": "rotation的单词含义，并非反转。", "time": "2015-05-19 23:02:28"}, {"content": "Note that this problem cannot be solved if the node to be deleted is the last node inthe linked list. That's ok—your interviewer wants you to point that out, and to discusshow to handle this cas", "time": "2015-05-25 01:43:15"}, {"content": "The second solution operates in a slightly different way. Instead of inserting nodes intothe end of the before 11st and the after list, it inserts nodes into the front of them", "time": "2015-05-25 01:48:51"}, {"content": "An easy way to detect if a linked list has a loop is through the FastRunner / Slow-Runner approach. FastRunner moves two steps at a time, while SlowRunner movesone step", "time": "2015-05-25 02:02:46"}], "duokanbookid": "uefb4ee581fdfbb342bbg02cg0g31fd3", "title": "Cracking the Coding Interview, 5th Edition"}