{"date": "2015-08-15", "source": "06be7f99-00ef-4a64-8000-e0f6d732337a.html", "notes": [{"content": "it’s still the same great chart-drawing, prototyping, wireframing app", "time": "2015-08-15 10:53:59"}, {"content": "You can drag and drop a Style Chit on other objects to quickly apply a batch of styles in your project", "time": "2015-08-15 10:57:04"}, {"content": "To create a Favorite Style, Control-click an object on the canvas and select Add to Favorite Shape Styles from the contextual menu", "time": "2015-08-15 11:09:52"}, {"content": "Similarly, you can press the number keys to activate tools. Each key from 1 to 0 corresponds to a tool in the palette, from left to right. (The only exceptions are the Hand and Action Browse Tool, which don’t have a number assigned; instead, use the Space Bar or b key, respectively.) Pressing a number key twice makes that particular tool persistent", "time": "2015-08-15 11:15:33"}, {"content": "Hold Command after you start dragging to temporarily enable or disable Smart Guides", "time": "2015-08-15 11:27:11"}, {"content": "• Hold Shift while resizing to maintain the aspect ratio of the original object.• Hold Option to resize an object with its center point being anchored.• Hold Shift-Option while resizing to maintain the aspect ratio and resize the object based on its center point.• Hold Command, and the resize control changes to a rotate control so you can rotate the objec", "time": "2015-08-15 11:28:51"}, {"content": "If you have objects of different sizes on the canvas, but would like them to be the same size, first select the object that has the dimensions you'd like the others to emulate, choose Arrange ▸ Size and then choose one of the resizing options", "time": "2015-08-15 11:34:43"}, {"content": "Any line (created with the Line tool) has two points: a red one at its source and a green one at its destination.", "time": "2015-08-15 11:43:15"}, {"content": "Custom shapes (created with the Pen tool) and Bézier-type lines have control points at each vertex. Click a control point to select it; if a control point is hiding behind a selection handle, Option-Command-click to select it", "time": "2015-08-15 11:44:48"}, {"content": "The default way to add points to an existing line is to double-click the line, but this can be changed in the General preferences (OmniGraffle ▸ Preferences ▸ General)", "time": "2015-08-15 11:46:02"}, {"content": "To delete a point from a line or a custom shape, select it and then either press the Delete key or select Edit ▸ Delete from the menu bar.", "time": "2015-08-15 11:46:18"}, {"content": "Hold Shift while dragging to make a shape of equal width and height (a perfect square, a perfect circle, and so on)", "time": "2015-08-15 11:49:12"}, {"content": "Hold Shift while drawing a line to constrain the next point to angles at 45-degree increments from the previous point. Hold Option while drawing a line to prevent it from connecting to objects", "time": "2015-08-15 11:53:02"}, {"content": "When two objects are connected by a line, the object at the source is considered the parent of the object at the destination. This defines the objects’ relationship in the outline view and when you use automatic layout", "time": "2015-08-15 11:53:46"}, {"content": "Lines can have line labels attached to them. Click a line with the Text tool to create a new text label. Or, drag an existing blob of text to the line until the line is highlighted, then drop it to attach it as a label", "time": "2015-08-15 11:55:06"}, {"content": "Bézier handles can define any shape, once you get the hang of them. Each point can have a handle facing the next point, and a handle facing the previous point", "time": "2015-08-15 12:04:55"}, {"content": "The Diagram tool is for rapidly creating new objects on the Canvas. This tool is especially fun if you have Auto layout turned on (Canvas Inspectors ▸ Diagram Layout, and then make sure Auto layout is checked).", "time": "2015-08-15 12:12:41"}, {"content": "The tool’s popup menu contains a list of styles that can be absorbed; select whichever ones you like, and the brush will only absorb or apply those styles", "time": "2015-08-15 12:16:13"}, {"content": "If you click on the Guides icon (the pink square to the right of each canvas), you’ll find OmniGraffle 6’s new Guides pop-up. To add a new guide, just click +; new guides are spaced apart evenly, or you can enter a specific value to position the guide exactly where you need it", "time": "2015-08-22 18:46:38"}, {"content": "While the Outline Editor is handy for entering lots of information quickly, an outline can’t always perfectly represent the relationships in a complicated diagram", "time": "2015-08-22 22:32:39"}, {"content": "Diagram Styles are OmniGraffle documents that define an appearance which you can apply to an outline or a diagram. There are infinite ways to represent the same data; a diagram style helps you indicate just how you want the data to be represented", "time": "2015-08-22 22:49:53"}, {"content": "Diagram Styles make it easy for you to get a visual representation of something that might otherwise just appear to be static text. For example, if you are a writer, this is a great way to map out the relationships of different characters or to visualize the story arc of that novel you’ve been working on", "time": "2015-08-22 22:54:37"}, {"content": "To open one particular inspector (for example the Stroke inspector) and close any other open inspectors, Shift-Option-click on the disclosure triangle. To open or close all of the inspectors, Shift-Command-click on one of the disclosure triangles.", "time": "2015-09-04 22:46:51"}, {"content": "(Pro) Check the Edit Points checkbox to convert the shape to a custom object with editable Bézier points.", "time": "2015-09-04 22:58:33"}, {"content": "Click the flip buttons to reverse the object horizontally or vertically.", "comment": "形状反转", "time": "2015-09-04 23:06:46"}, {"content": "Use the pop-up menu to set how the label’s text appears in relation to the line. Options include: Horizontal, Vertical, Parallel, Perpendicular, Independent, and Follows Path. Use the slider next to the pop-up menu to change the label’s position in relation to the line.", "time": "2015-09-04 23:10:00"}, {"content": "Next to the align buttons are two spread buttons. Click the horizontal spread button to distribute the selected objects evenly between the leftmost and rightmost objects. Click the vertical spread button to distribute the selected objects evenly between the top and bottom objects. These buttons are only useful when you have at least three objects selected.", "time": "2015-09-04 23:13:57"}, {"content": "The purpose of this tutorial is two-fold. Our first goal is to introduce you to everything that OmniGraffle can do, but the ultimate goal of this tutorial is to help you master OmniGraffle as soon as possible.", "time": "2015-09-04 23:29:10"}, {"content": "Use the keyboard shortcut, Option-Command–3, to switch to the Outline view. In the Contents section, click on where it says “Click to add a topic” to create your first object", "comment": "以这种outline的方式创建图形未尝不可，这样确实很快", "time": "2015-09-04 23:34:13"}, {"content": "Choose View ▸ Show Inspector ▸ Canvas (Command–4), and then scroll down in the inspectors sidebar to the Units section; change the Units popup from Inches to Points.", "time": "2015-08-24 23:58:23"}, {"content": "With Don John still selected, look at the bottom of the main window for the style tray. It contains all of the style attributes for the currently selected object, each one represented by a little square “style chit”.", "time": "2015-09-05 17:53:11"}, {"content": "Let’s style the remaining objects. A quick way to select lots of shapes at once is with the Contents inspector, located in the left sidebar.", "time": "2015-09-05 18:08:11"}, {"content": "You’ve learned how to use the Outline Editor (Option-Command–3) to quickly add new blocks to the diagram, and how to use the Selection Matrix (Option-Command–4) to quickly edit and apply styles to multiple blocks and lines simultaneously.", "time": "2015-09-05 18:23:48"}, {"content": "Switch to the Object inspector and under Stroke, set the stroke’s width to 0 pt, and change the stroke style to No Stroke. This gives you an “invisible” path that you can add text to", "time": "2015-09-05 18:29:59"}], "duokanbookid": "n511b65ee256b464dc740g37bf6909e9", "title": "OmniGraffle-6-Manual"}