{"date": "2016-05-21", "source": "b9ad410f-fa38-48e9-98a3-39d0ceb35111.html", "notes": [{"content": "Some of these form interface elements - text input or checkboxes - are fairly simple and are built into HTML itself.Others are much more complex; an interface that pops up a date picker or allows you to move a slider or manipulatecontrols will typically use JavaScript and CSS as well as HTML form <input> elements to achieve these effects.", "comment": "表单要处理各种复杂的输入", "time": "2016-05-21 12:30:10"}, {"content": "Django handles three distinct parts of the work involved in forms:• preparing and restructuring data to make it ready for rendering• creating HTML forms for the data• receiving and processing submitted forms and data from the client", "time": "2016-05-21 12:34:44"}, {"content": "When we instantiate a form, we can opt to leave it empty or pre-populate it, for example with:• data from a saved model instance (as in the case of admin forms for editing)• data that we have collated from other sources• data received from a previous HTML form submission", "time": "2016-05-21 12:39:00"}, {"content": "A Form instance has an is_valid() method, which runs validation routines for all itsﬁelds. When this method iscalled, if allﬁelds contain valid data, it will:• return True• place the form’s data in its cleaned_data attribute.", "time": "2016-05-21 12:41:59"}, {"content": "All form classes are created as subclasses of django.forms.Form, including the ModelForm, which you en-counter in Django’s admin.\nModels and FormsIn fact if your form is going to be used to directly add or edit a Django model, a ModelForm can save you a greatdeal of time, effort, and code, because it will build a form, along with the appropriateﬁelds and their attributes, froma Model class.", "comment": "django admin借助ModelForm来快速实现表单功能", "time": "2016-05-21 12:47:54"}, {"content": "An unbound form has no data associated with it. When rendered to the user, it will be empty or will containdefault values.• A bound form has submitted data, and hence can be used to tell if that data is valid. If an invalid bound form isrendered, it can include inline error messages telling the user what data to correct.The form’s is_bound attribute will tell you whether a form has data bound to it or not.", "time": "2016-05-21 12:50:19"}, {"content": "There are other output options though for the <label>/<input> pairs:• {{ form.as_table }} will render them as table cells wrapped in <tr> tags• {{ form.as_p }} will render them wrapped in <p> tags• {{ form.as_ul }} will render them wrapped in <li> tagsNote that you’ll have to provide the surrounding <table> or <ul> elements yourself.", "time": "2016-05-21 12:57:44"}, {"content": "Using class-based views\nAt its core, a class-based view allows you to respond to different HTTP request methods with different class instancemethods, instead of with conditionally branching code inside a single view function.", "comment": "避免不优雅的分支判断", "time": "2016-05-26 10:45:53"}, {"content": "ThereareseveralcommandswhichyouwillusetointeractwithmigrationsandDjango’shandlingofdatabaseschema:• migrate, which is responsible for applying migrations, as well as unapplying and listing their status.• makemigrations, which is responsible for creating new migrations based on the changes you have made toyour models.• sqlmigrate, which displays the SQL statements for a migration.• showmigrations, which lists a project’s migrations.", "comment": "注意第三个，假如dba不允许使用基于orm的migrate，则我们可以用它生成ddl", "time": "2016-05-26 22:10:21"}, {"content": "The Library.filter() method takes two arguments:1. The name of theﬁlter – a string.2. The compilation function – a Python function (not the name of the function as a string).You can use register.filter() as a decorator instead:@register.filter(name='cut')def cut(value, arg):return value.replace(arg, '')\n@register.filterdef lower(value):return value.lower()", "comment": "装饰器的方式注册filter看起来更优雅", "time": "2016-05-27 10:39:14"}], "duokanbookid": "s53128c5ec8065975g785d1c5375532c", "title": "Django Documentation 1.9"}