{"date": "2016-07-16", "source": "ab5eb4d2-138e-45f6-81e2-d45506efc89a.html", "notes": [{"content": "One of the great successes of the web as a platformis the (mostly) seamless cooperation of such technologies, enabled bya shared representation of the page called the document object model(DOM). The DOM exposes the hierarchical structure of page content,such as paragraph and table elements, allowing reference and manip-ulation.", "time": "2016-07-16 18:20:45"}, {"content": "3 D\nESIGND3’satomicoperandistheselection: aﬁlteredsetofelementsqueriedfrom the current document. Operators act on selections, modifyingcontent. Data joins bind input data to elements, enabling functionaloperators that depend on data, and producing enter and exit subselec-tions for the creation and destruction of elements in correspondencewith data. While operators apply instantaneously by default, animatedtransitions interpolate attributes and styles smoothly over time. Spe-cial operators called event handlers respond to user input and enableinteraction. Numerous helper modules, such as layouts and scales,simplify common visualization tasks.", "comment": "D3核心概念", "time": "2016-07-16 20:42:20"}, {"content": "Any number of operators can be applied to selected elements.These operators wrap the W3C DOM API, setting attributes (attr),styles (style), properties (property), HTML (html) and text(text) content. Operator values are speciﬁed either as constants orfunctions; the latter are evaluated for each element. While the built-inoperators satisfy most needs, the each operator invokes an arbitraryJavaScript callback for total generality. Since each selection is simplyan array, elements can also be accessed directly (e.g., [0]).", "comment": "operator value可以为常量，也可以为函数", "time": "2016-07-16 20:46:41"}, {"content": "D3 supports method chaining for brevity when applying multipleoperators: the operator return value is the selection. (For example, thepiechartinFigure7isasinglestatement.) Theappendandinsertoperators add a new element for each element in the current selection,returning the added nodes, thus allowing the convenient creation ofnested structures. The remove operator discards selected elements.", "comment": "类似jquery的链式方法调用", "time": "2016-07-16 20:48:25"}, {"content": "Subselecting via selectAll groups elements by ancestor. Thus,d3.selectAll(\"p\").selectAll(\"b\") groups by paragraph,while d3.selectAll(\"p b\") returns aﬂat selection. Subselect-ing via select is similar, but preserves groups and propagates data.Grouping plays an important role in the data join (see x3.2), and func-tional operators may depend on the numeric index of the current ele-ment within its group (as in the x scale of Figure 5).", "comment": "两个链式selectAll调用返回的是grouping后的结果", "time": "2016-07-16 20:51:00"}, {"content": "If data or elements are leftover after computing the data join, theseare available in the enter and exit subselections, respectively. The en-tering data have no corresponding nodes; the exiting nodes have nocorresponding data. For example, if data is joined to the empty selec-tion, the enter operator returns placeholder nodes for each incomingdatum; these nodes can then be instantiated via append or insert.Similarly, if new data is joined to an existing selection, the exit op-erator returns elements bound to outgoing data to allow removal.", "time": "2016-07-18 10:39:47"}, {"content": "The delineation of enter, update and exit allows precise control ofthe element lifecycle. Properties that are constant for the life of the el-ement are set once on enter, while dynamic properties are recomputed", "comment": "enter，update，exit可以精准地控制元素的生命周期", "time": "2016-07-18 10:44:32"}, {"content": "The document object model supports event listeners: callback func-tions that receive user input events targeted at speciﬁc elements. D3’son operator exposes this functionality for native event types. For con-sistency with other functional operators, the callback receives the dataand index as arguments (d, i), allowing data-driven interaction. Thetargeted node is this, and the current event is d3.event.", "comment": "事件监听，以及几个重要参数", "time": "2016-07-18 10:46:56"}], "duokanbookid": "pbe4119b391fc7d7dfg22edfg5c026eg", "title": "D3: Data-Driven Documents"}